app/Http/Controllers/AuthController.php

insert into `users` (`name`, `email`, `password`, `updated_at`, `created_at`) values ('Mike', 'mike@gmail.com', '$2y$12$5ExAjSlOPw59/CiqFdqFJ.RCUEcuh1lK4T3DAbjyGj5ynwXyf3eo6', '2025-02-27 06:38:43', '2025-02-27 06:38:43')
---
    public function register(Request $request)
    {
        $fields = $request->validate([
            'name' => 'required|max:255',
            'email' => 'required|email|unique:users',
            'password' => 'required|confirmed'
        ]);

        $user = User::create($fields);

select * from `users` where `email` = 'test@example.com' limit 1
---
    public function login(Request $request)
    {
        $request->validate([
            'email' => 'required|email|exists:users',
            'password' => 'required'
        ]);

        $user = User::where('email', $request->email)->first();