app/Http/Controllers/PostController.php

    public function index()
    {
        return Post::all();
---
select * from `posts`

    public function store(Request $request)
    {
        $fields = $request->validate([
            'title' => 'required|max:255',
            'body' => 'required'
        ]);

        $post = $request->user()->posts()->create($fields);
---
insert into `posts` (`title`, `body`, `user_id`, `updated_at`, `created_at`) values ('Post title 1', 'Post body 1', 1, '2025-02-27 06:28:44', '2025-02-27 06:28:44')

    public function show($id)
    {
        try {
            $post = Post::findOrFail($id);
---
select * from `posts` where `posts`.`id` = '1' limit 1